---
kind: method
id: M:Autodesk.Revit.DB.LogicalOrFilter.#ctor(Autodesk.Revit.DB.ElementFilter,Autodesk.Revit.DB.ElementFilter)
source: html/c672e200-4498-0af0-29c3-d3bc1eb31466.htm
---
# Autodesk.Revit.DB.LogicalOrFilter.#ctor Method

Constructs a new instance of the logical filter with two input filters.

## Syntax (C#)
```csharp
public LogicalOrFilter(
	ElementFilter filter1,
	ElementFilter filter2
)
```

## Parameters
- **filter1** (`Autodesk.Revit.DB.ElementFilter`) - The first filter.
- **filter2** (`Autodesk.Revit.DB.ElementFilter`) - The second filter.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null